app/Controllers/Artikel.php

SELECT *
FROM `artikel`
---
    public function index()
    {
        $model = new ArtikelModel();
        $data['artikel'] = $model->findAll();

SELECT *
FROM `artikel`
WHERE `slug` = 'The-Angel-Next-Door'
 LIMIT 1
---
    public function view($slug)
    {
        $model = new ArtikelModel();
        $data['artikel'] = $model->where(['slug' => $slug])->first();

SELECT *
FROM `artikel`
---
    public function admin_index()
    {
        $model = new ArtikelModel();
        $data['artikel'] = $model->findAll();

SELECT *
FROM `artikel`
WHERE `artikel`.`id` = '1'
---
    public function edit($id)
    {
        $model = new ArtikelModel();
        $dataLama = $model->find($id);